Courses/4420/Lectures/Fortification/fortify.org

# -*- mode: org -*-
# -*- org-export-html-postamble:t; -*-
#+STARTUP:showeverything
#+TITLE: Fortification TBD
#+AUTHOR: Prabhaker Mateti
#+OPTIONS: toc:1
#+LINK_HOME: ../Top
#+LINK_UP: ../../index.html
#+DESCRIPTION: Online CEG6420 Course
#+STYLE: <style> P { text-align: justify } @media screen {BODY {margin: 10%} }</style>
#+BIND: org-export-html-preamble-format (("en" "<a href=\"http://cecs.wright.edu/~pmateti/Courses/4420/\">OnLine CEG 6420: Computer Security</a>"))
#+BIND: org-export-html-postamble-format (("en" "<hr size=1>Copyright &copy; 2013 &bull; <a href=\"http://www.wright.edu/~pmateti\"> www.wright.edu/~pmateti</a> &bull; %d"))


* Educational Objectives

Students should be able to

1. Determine minimal sofware that meets the expected system functionality
1. Uninstall unneeded components
1. Install security improving components
1. TBD 

* What is Fortification?

1. Install and configure additional software that improves security
1. Removing unnecessary services/software
1. Security updates/ patching the OS and system utilities
1. Example Fortifications
   1. Encrypted File Systems
   1. Virus detection and removal
   1. Rootkit Detection and Removal
   1. Continuous System Audit
   1. Containers (Lightweight virtualization)
   1. SELinux security enhancements from NSA

* Notable Linux Security Updates
1. CVE-2013-2888, ... Crashing the system via DoS, Privilege Escalation, Information leak

* Malware
1. Malware = viruses + worms + Trojans
1. Linux/Unix can be infected with malware.
1. E.g.,  "The Hand of Thief" 2013 banking Trojan protype
1. A Linux server can scan and remove viruses from Windows files

* Linux Kernel Internals: Digging Deeper 
** namespaces
1. (ipc, uts, mount, pid, network and user)

** Seccomp (secure computing mode)
1. sandboxing mechanism in the kernel
1. After a process starts, a one-way transition into a state
   where no system calls except =exit, sigreturn,
   read, write= and =close= are permitted.
1. Attempts to other system calls, will =SIGKILL= the process.
1. Process enters =seccom= via =prctl()= system call
1. Programs using this: OpenSSH, vsftpd, Chrome, ...

** Chroots
** capabilities
** Control Groups (cgroups)

* Rootkit Removal
** What are Rootkits, Trojans and Backdoors
** How do rootkit programs work?
** Contents of Linux Root Kit 5
** Detecting Rootkis
** Removal of Rootkits

* System Audit
1. tripwire

* Secure Linux containers

** What is a Container?
1. Lightweight virtual OSs running inside Linux
2. Not a virtual machine like VirtualBox or VMware
3. A container is a group of processes in a "box"
   1. Inside the box, it looks like a VM.
   2. Outside the box, it TBD looks like normal processes.
   3. "chroot on steroids"
1. Process isolation
1. Name space isolation
1. What is a Hypervisor?
1. Example container software: LXC, Docker, OpenVZ.org

** LXC on Ubuntu
1. https://help.ubuntu.com/lts/serverguide/lxc.html
1. # apt-get install lxc
1. LXC v KVM 
   KVM is a virtual machine running on Linux kernel
   Relies on assistance from the CPU 
   Uses paravirtualization to reduce overhead

1. LXC v Xen
   Both are light weight virtual OS, not VM

* AppArmor
1. AppArmor is a Linux Security Module (LSM)
1. Name-based Access Controls

. AppArmor confines individual programs to a set of
listed files and posix 1003.1e draft capabilities.

* SELinux

* ptrace scope

* Lab Experiment
1. Takes 1 to 2 hours by the student
1. Practices things discussed above, but not all
   1. Includes list: tripwire, ?webmin
   1. Excluded list: password cracking (a separate lab)

1. Download a Linux ISO we provide (time taken not counted)
1. Student installs on a USBD or in a virtual box (10 - 15 min)
1. Examines this system (30 min)
1. Fortifies this system (60 min)
1. Writes a lab report (30 min)

* Misc

** Linux Memory Forensics  


1. =ls -l /proc/sys/vm=
1. Keep kernel details confidential =ls -l /boot=
#+begin_src bash
-rw-r--r-- 1 root    root     1007311 Oct  2 19:19 abi-3.11.0-11-lowlatency
-rw-r--r-- 1 root    root      163504 Oct  2 19:19 config-3.11.0-11-lowlatency
-rw-r--r-- 1 root    root    26228945 Oct 17 23:33 initrd.img-3.11.0-11-lowlatency
-rw------- 1 root    root     3310511 Oct  2 19:19 System.map-3.11.0-11-lowlatency
-rw------- 1 root    root     5674032 Oct  2 19:19 vmlinuz-3.11.0-11-lowlatency
#+end_src

