Courses/4420/Lectures/Hardening/Fortification/fortify.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Fortification TBD</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Fortification TBD"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-11-07T15:21-0500"/>
<meta name="author" content="Prabhaker Mateti"/>
<meta name="description" content="Online CEG6420 Course"/>
<meta name="keywords" content=""/>

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../../index.html"> UP </a>
 |
 <a accesskey="H" href="../Top"> HOME </a>
</div>

<div id="preamble">
<a href="http://cecs.wright.edu/~pmateti/Courses/4420/">OnLine CEG 6420: Computer Security</a>
</div>

<div id="content">
<h1 class="title">Fortification TBD</h1>




<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Educational Objectives</a></li>
<li><a href="#sec-2">2 What is Fortification?</a></li>
<li><a href="#sec-3">3 Notable Linux Security Updates</a></li>
<li><a href="#sec-4">4 Malware</a></li>
<li><a href="#sec-5">5 Linux Kernel Internals: Digging Deeper</a></li>
<li><a href="#sec-6">6 Rootkit Removal</a></li>
<li><a href="#sec-7">7 System Audit</a></li>
<li><a href="#sec-8">8 Secure Linux containers</a></li>
<li><a href="#sec-9">9 AppArmor</a></li>
<li><a href="#sec-10">10 SELinux</a></li>
<li><a href="#sec-11">11 ptrace scope</a></li>
<li><a href="#sec-12">12 Lab Experiment</a></li>
<li><a href="#sec-13">13 Misc</a></li>
<li><a href="#sec-14">14 References</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Educational Objectives</h2>
<div class="outline-text-2" id="text-1">


<p>
Students should be able to
</p>
<ol>
<li>Determine minimal sofware that meets the expected system functionality
</li>
<li>Uninstall unneeded components
</li>
<li>Install security improving components
</li>
<li>TBD 
</li>
</ol>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> What is Fortification?</h2>
<div class="outline-text-2" id="text-2">


<ol>
<li>Install and configure additional software that improves security
</li>
<li>Removing unnecessary services/software
</li>
<li>Security updates/ patching the OS and system utilities
</li>
<li>Example Fortifications
<ol>
<li>Encrypted File Systems
</li>
<li>Virus detection and removal
</li>
<li>Rootkit Detection and Removal
</li>
<li>Continuous System Audit
</li>
<li>Containers (Lightweight virtualization)
</li>
<li>SELinux security enhancements from NSA
</li>
</ol>

</li>
</ol>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Notable Linux Security Updates</h2>
<div class="outline-text-2" id="text-3">

<ol>
<li>CVE-2013-2888, &hellip; Crashing the system via DoS, Privilege Escalation, Information leak
</li>
</ol>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Malware</h2>
<div class="outline-text-2" id="text-4">

<ol>
<li>Malware = viruses + worms + Trojans
</li>
<li>Linux/Unix can be infected with malware.
</li>
<li>E.g.,  "The Hand of Thief" 2013 banking Trojan protype
</li>
<li>A Linux server can scan and remove viruses from Windows files
</li>
</ol>


</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Linux Kernel Internals: Digging Deeper</h2>
<div class="outline-text-2" id="text-5">


</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> namespaces</h3>
<div class="outline-text-3" id="text-5-1">

<ol>
<li>(ipc, uts, mount, pid, network and user)
</li>
</ol>


</div>

</div>

<div id="outline-container-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> Seccomp (secure computing mode)</h3>
<div class="outline-text-3" id="text-5-2">

<ol>
<li>sandboxing mechanism in the kernel
</li>
<li>After a process starts, a one-way transition into a state
   where no system calls except <code>exit, sigreturn,    read, write</code> and <code>close</code> are permitted.
</li>
<li>Attempts to other system calls, will <code>SIGKILL</code> the process.
</li>
<li>Process enters <code>seccom</code> via <code>prctl()</code> system call
</li>
<li>Programs using this: OpenSSH, vsftpd, Chrome, &hellip;
</li>
</ol>


</div>

</div>

<div id="outline-container-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> Chroots</h3>
<div class="outline-text-3" id="text-5-3">

</div>

</div>

<div id="outline-container-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> capabilities</h3>
<div class="outline-text-3" id="text-5-4">

</div>

</div>

<div id="outline-container-5-5" class="outline-3">
<h3 id="sec-5-5"><span class="section-number-3">5.5</span> Control Groups (cgroups)</h3>
<div class="outline-text-3" id="text-5-5">


</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Rootkit Removal</h2>
<div class="outline-text-2" id="text-6">


</div>

<div id="outline-container-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> What are Rootkits, Trojans and Backdoors</h3>
<div class="outline-text-3" id="text-6-1">

</div>

</div>

<div id="outline-container-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> How do rootkit programs work?</h3>
<div class="outline-text-3" id="text-6-2">

</div>

</div>

<div id="outline-container-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> Contents of Linux Root Kit 5</h3>
<div class="outline-text-3" id="text-6-3">

</div>

</div>

<div id="outline-container-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> Detecting Rootkis</h3>
<div class="outline-text-3" id="text-6-4">

</div>

</div>

<div id="outline-container-6-5" class="outline-3">
<h3 id="sec-6-5"><span class="section-number-3">6.5</span> Removal of Rootkits</h3>
<div class="outline-text-3" id="text-6-5">


</div>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> System Audit</h2>
<div class="outline-text-2" id="text-7">

<ol>
<li>tripwire
</li>
</ol>


</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Secure Linux containers</h2>
<div class="outline-text-2" id="text-8">



</div>

<div id="outline-container-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> What is a Container?</h3>
<div class="outline-text-3" id="text-8-1">

<ol>
<li>Lightweight virtual OSs running inside Linux
</li>
<li>Not a virtual machine like VirtualBox or VMware
</li>
<li>A container is a group of processes in a "box"
<ol>
<li>Inside the box, it looks like a VM.
</li>
<li>Outside the box, it TBD looks like normal processes.
</li>
<li>"chroot on steroids"
</li>
</ol>

</li>
<li>Process isolation
</li>
<li>Name space isolation
</li>
<li>What is a Hypervisor?
</li>
<li>Example container software: LXC, Docker, OpenVZ.org
</li>
</ol>


</div>

</div>

<div id="outline-container-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> LXC on Ubuntu</h3>
<div class="outline-text-3" id="text-8-2">

<ol>
<li><a href="https://help.ubuntu.com/lts/serverguide/lxc.html">https://help.ubuntu.com/lts/serverguide/lxc.html</a>
</li>
<li># apt-get install lxc
</li>
<li>LXC v KVM 
   KVM is a virtual machine running on Linux kernel
   Relies on assistance from the CPU 
   Uses paravirtualization to reduce overhead

</li>
<li>LXC v Xen
   Both are light weight virtual OS, not VM
</li>
</ol>


</div>
</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> AppArmor</h2>
<div class="outline-text-2" id="text-9">

<ol>
<li>AppArmor is a Linux Security Module (LSM)
</li>
<li>Name-based Access Controls
</li>
</ol>


<p>
. AppArmor confines individual programs to a set of
listed files and posix 1003.1e draft capabilities.
</p>
</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> SELinux</h2>
<div class="outline-text-2" id="text-10">


</div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> ptrace scope</h2>
<div class="outline-text-2" id="text-11">


</div>

</div>

<div id="outline-container-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> Lab Experiment</h2>
<div class="outline-text-2" id="text-12">

<ol>
<li>Takes 1 to 2 hours by the student
</li>
<li>Practices things discussed above, but not all
<ol>
<li>Includes list: tripwire, ?webmin
</li>
<li>Excluded list: password cracking (a separate lab)

</li>
</ol>

</li>
<li>Download a Linux ISO we provide (time taken not counted)
</li>
<li>Student installs on a USBD or in a virtual box (10 - 15 min)
</li>
<li>Examines this system (30 min)
</li>
<li>Fortifies this system (60 min)
</li>
<li>Writes a lab report (30 min)
</li>
</ol>


</div>

</div>

<div id="outline-container-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> Misc</h2>
<div class="outline-text-2" id="text-13">



</div>

<div id="outline-container-13-1" class="outline-3">
<h3 id="sec-13-1"><span class="section-number-3">13.1</span> Linux Memory Forensics</h3>
<div class="outline-text-3" id="text-13-1">



<ol>
<li><code>ls -l /proc/sys/vm</code>
</li>
<li>Keep kernel details confidential <code>ls -l /boot</code>
</li>
</ol>




<pre class="example">-rw-r--r-- 1 root    root     1007311 Oct  2 19:19 abi-3.11.0-11-lowlatency
-rw-r--r-- 1 root    root      163504 Oct  2 19:19 config-3.11.0-11-lowlatency
-rw-r--r-- 1 root    root    26228945 Oct 17 23:33 initrd.img-3.11.0-11-lowlatency
-rw------- 1 root    root     3310511 Oct  2 19:19 System.map-3.11.0-11-lowlatency
-rw------- 1 root    root     5674032 Oct  2 19:19 vmlinuz-3.11.0-11-lowlatency
</pre>


</div>

</div>
