Courses/4420/Lectures/Fortification/fortify.org
** Restrict unprivileged access to the kernel syslog (SECURITY_DMESG_RESTRICT)

CONFIG_SECURITY_DMESG_RESTRICT:

This enforces restrictions on unprivileged users reading the kernel
syslog via dmesg(8).

If this option is not selected, no restrictions will be enforced
unless the dmesg_restrict sysctl is explicitly set to (1).

If you are unsure how to answer this question, answer N.

Symbol: SECURITY_DMESG_RESTRICT [=n]
Type : boolean
Prompt: Restrict unprivileged access to the kernel syslog
Location:
-> Security options
Defined at security/Kconfig:9

** Enable different security models (SECURITY)

CONFIG_SECURITY:

This allows you to choose different security modules to be
configured into your kernel.

If this option is not selected, the default Linux security
model will be used.

If you are unsure how to answer this question, answer N.

Symbol: SECURITY [=y]
Type : boolean
Prompt: Enable different security models
Location:
-> Security options
Defined at security/Kconfig:21
Depends on: SYSFS [=y]

** Enable the securityfs filesystem (SECURITYFS)

CONFIG_SECURITYFS:

This will build the securityfs filesystem. It is currently used by
the TPM bios character driver and IMA, an integrity provider. It is
not used by SELinux or SMACK.

If you are unsure how to answer this question, answer N.

Symbol: SECURITYFS [=y]
Type : boolean
Prompt: Enable the securityfs filesystem
Location:
-> Security options
Defined at security/Kconfig:33
Selected by: TCG_TPM [=y] && HAS_IOMEM [=y] || SECURITY_TOMOYO [=y] && SECURITY [=y] && NET [=y] || SECURITY_APPARMOR [=y] && SECURITY [=y] && NET [=y] || SECURITY_YAMA [=y] && SECURITY [=y] || IMA [=n] && SECURITY [=y]


** Security hooks for pathname based access control (SECURITY_PATH)

CONFIG_SECURITY_PATH:

This enables the security hooks for pathname based access control.
If enabled, a security module can use these hooks to
implement pathname based access controls.
If you are unsure how to answer this question, answer N.

Symbol: SECURITY_PATH [=y]
Type : boolean
Prompt: Security hooks for pathname based access control
Location:
-> Security options
Defined at security/Kconfig:64
Depends on: SECURITY [=y]
Selected by: SECURITY_TOMOYO [=y] && SECURITY [=y] && NET [=y] || SECURITY_APPARMOR [=y] && SECURITY [=y] && NET [=y] || SECURITY_YAMA [=y] && SECURITY [=y]

** NSA SELinux Support (SECURITY_SELINUX)

CONFIG_SECURITY_SELINUX:

This selects NSA Security-Enhanced Linux (SELinux).
You will also need a policy configuration and a labeled filesystem.
If you are unsure how to answer this question, answer N.

Symbol: SECURITY_SELINUX [=y]
Type : boolean
Prompt: NSA SELinux Support
Location:
-> Security options
Defined at security/selinux/Kconfig:1
Depends on: SECURITY_NETWORK [=y] && AUDIT [=y] && NET [=y] && INET [=y]
Selects: NETWORK_SECMARK [=y]

** Simplified Mandatory Access Control Kernel Support (SECURITY_SMACK)

CONFIG_SECURITY_SMACK:

This selects the Simplified Mandatory Access Control Kernel.
Smack is useful for sensitivity, integrity, and a variety
of other mandatory security schemes.
If you are unsure how to answer this question, answer N.


Symbol: SECURITY_SMACK [=y]
Type : boolean
Prompt: Simplified Mandatory Access Control Kernel Support
Location:
-> Security options
Defined at security/smack/Kconfig:1
Depends on: NET [=y] && INET [=y] && SECURITY [=y]
Selects: NETLABEL [=y] && SECURITY_NETWORK [=y]

** TOMOYO Linux Support (SECURITY_TOMOYO)

CONFIG_SECURITY_TOMOYO:

This selects TOMOYO Linux, pathname-based access control.
Required userspace tools and further information may be
found at <http://tomoyo.sourceforge.jp/>.
If you are unsure how to answer this question, answer N.

Symbol: SECURITY_TOMOYO [=y]
Type : boolean
Prompt: TOMOYO Linux Support
Location:
-> Security options
Defined at security/tomoyo/Kconfig:1
Depends on: SECURITY [=y] && NET [=y]
Selects: SECURITYFS [=y] && SECURITY_PATH [=y] && SECURITY_NETWORK [=y]


** AppArmor support (SECURITY_APPARMOR)

CONFIG_SECURITY_APPARMOR:

This enables the AppArmor security module.
Required userspace tools (if they are not included in your
distribution) and further information may be found at
http://apparmor.wiki.kernel.org

If you are unsure how to answer this question, answer N.

Symbol: SECURITY_APPARMOR [=y]
Type : boolean
Prompt: AppArmor support
Location:
-> Security options
Defined at security/apparmor/Kconfig:1
Depends on: SECURITY [=y] && NET [=y]
Selects: AUDIT [=y] && SECURITY_PATH [=y] && SECURITYFS [=y] && SECURITY_NETWORK [=y]

** Yama support (SECURITY_YAMA)

CONFIG_SECURITY_YAMA:

This selects Yama, which extends DAC support with additional
system-wide security settings beyond regular Linux discretionary
access controls. Currently available is ptrace scope restriction.
Further information can be found in Documentation/security/Yama.txt.

If you are unsure how to answer this question, answer N.

Symbol: SECURITY_YAMA [=y]
Type : boolean
Prompt: Yama support
Location:
-> Security options
Defined at security/yama/Kconfig:1
Depends on: SECURITY [=y]
Selects: SECURITYFS [=y] && SECURITY_PATH [=y]

** Digital signature verification using multiple keyrings (INTEGRITY_SIGNATURE)

CONFIG_INTEGRITY_SIGNATURE:

This option enables digital signature verification support
using multiple keyrings. It defines separate keyrings for each
of the different use cases - evm, ima, and modules.
Different keyrings improves search performance, but also allow
to "lock" certain keyring to prevent adding new keys.
This is useful for evm and module keyrings, when keys are
usually only added from initramfs.

Symbol: INTEGRITY_SIGNATURE [=y]
Type : boolean
Prompt: Digital signature verification using multiple keyrings
Location:
-> Security options
Defined at security/integrity/Kconfig:6
Depends on: INTEGRITY [=y] && KEYS [=y]
Selects: SIGNATURE [=y]

