Courses/4420/Lectures/Hardening/Fortification/fortify.html

<div id="outline-container-13-2" class="outline-3">
<h3 id="sec-13-2"><span class="section-number-3">13.2</span> Restrict unprivileged access to the kernel syslog (SECURITY<sub>DMESG</sub><sub>RESTRICT</sub>)</h3>
<div class="outline-text-3" id="text-13-2">


<p>
CONFIG<sub>SECURITY</sub><sub>DMESG</sub><sub>RESTRICT</sub>:
</p>
<p>
This enforces restrictions on unprivileged users reading the kernel
syslog via dmesg(8).
</p>
<p>
If this option is not selected, no restrictions will be enforced
unless the dmesg<sub>restrict</sub> sysctl is explicitly set to (1).
</p>
<p>
If you are unsure how to answer this question, answer N.
</p>
<p>
Symbol: SECURITY<sub>DMESG</sub><sub>RESTRICT</sub> [=n]
Type : boolean
Prompt: Restrict unprivileged access to the kernel syslog
Location:
-&gt; Security options
Defined at security/Kconfig:9
</p>
</div>

</div>

<div id="outline-container-13-3" class="outline-3">
<h3 id="sec-13-3"><span class="section-number-3">13.3</span> Enable different security models (SECURITY)</h3>
<div class="outline-text-3" id="text-13-3">


<p>
CONFIG<sub>SECURITY</sub>:
</p>
<p>
This allows you to choose different security modules to be
configured into your kernel.
</p>
<p>
If this option is not selected, the default Linux security
model will be used.
</p>
<p>
If you are unsure how to answer this question, answer N.
</p>
<p>
Symbol: SECURITY [=y]
Type : boolean
Prompt: Enable different security models
Location:
-&gt; Security options
Defined at security/Kconfig:21
Depends on: SYSFS [=y]
</p>
</div>

</div>

<div id="outline-container-13-4" class="outline-3">
<h3 id="sec-13-4"><span class="section-number-3">13.4</span> Enable the securityfs filesystem (SECURITYFS)</h3>
<div class="outline-text-3" id="text-13-4">


<p>
CONFIG<sub>SECURITYFS</sub>:
</p>
<p>
This will build the securityfs filesystem. It is currently used by
the TPM bios character driver and IMA, an integrity provider. It is
not used by SELinux or SMACK.
</p>
<p>
If you are unsure how to answer this question, answer N.
</p>
<p>
Symbol: SECURITYFS [=y]
Type : boolean
Prompt: Enable the securityfs filesystem
Location:
-&gt; Security options
Defined at security/Kconfig:33
Selected by: TCG<sub>TPM</sub> [=y] &amp;&amp; HAS<sub>IOMEM</sub> [=y] || SECURITY<sub>TOMOYO</sub> [=y] &amp;&amp; SECURITY [=y] &amp;&amp; NET [=y] || SECURITY<sub>APPARMOR</sub> [=y] &amp;&amp; SECURITY [=y] &amp;&amp; NET [=y] || SECURITY<sub>YAMA</sub> [=y] &amp;&amp; SECURITY [=y] || IMA [=n] &amp;&amp; SECURITY [=y]
</p>

</div>

</div>

<div id="outline-container-13-5" class="outline-3">
<h3 id="sec-13-5"><span class="section-number-3">13.5</span> Security hooks for pathname based access control (SECURITY<sub>PATH</sub>)</h3>
<div class="outline-text-3" id="text-13-5">


<p>
CONFIG<sub>SECURITY</sub><sub>PATH</sub>:
</p>
<p>
This enables the security hooks for pathname based access control.
If enabled, a security module can use these hooks to
implement pathname based access controls.
If you are unsure how to answer this question, answer N.
</p>
<p>
Symbol: SECURITY<sub>PATH</sub> [=y]
Type : boolean
Prompt: Security hooks for pathname based access control
Location:
-&gt; Security options
Defined at security/Kconfig:64
Depends on: SECURITY [=y]
Selected by: SECURITY<sub>TOMOYO</sub> [=y] &amp;&amp; SECURITY [=y] &amp;&amp; NET [=y] || SECURITY<sub>APPARMOR</sub> [=y] &amp;&amp; SECURITY [=y] &amp;&amp; NET [=y] || SECURITY<sub>YAMA</sub> [=y] &amp;&amp; SECURITY [=y]
</p>
</div>

</div>

<div id="outline-container-13-6" class="outline-3">
<h3 id="sec-13-6"><span class="section-number-3">13.6</span> NSA SELinux Support (SECURITY<sub>SELINUX</sub>)</h3>
<div class="outline-text-3" id="text-13-6">


<p>
CONFIG<sub>SECURITY</sub><sub>SELINUX</sub>:
</p>
<p>
This selects NSA Security-Enhanced Linux (SELinux).
You will also need a policy configuration and a labeled filesystem.
If you are unsure how to answer this question, answer N.
</p>
<p>
Symbol: SECURITY<sub>SELINUX</sub> [=y]
Type : boolean
Prompt: NSA SELinux Support
Location:
-&gt; Security options
Defined at security/selinux/Kconfig:1
Depends on: SECURITY<sub>NETWORK</sub> [=y] &amp;&amp; AUDIT [=y] &amp;&amp; NET [=y] &amp;&amp; INET [=y]
Selects: NETWORK<sub>SECMARK</sub> [=y]
</p>
</div>

</div>

<div id="outline-container-13-7" class="outline-3">
<h3 id="sec-13-7"><span class="section-number-3">13.7</span> Simplified Mandatory Access Control Kernel Support (SECURITY<sub>SMACK</sub>)</h3>
<div class="outline-text-3" id="text-13-7">


<p>
CONFIG<sub>SECURITY</sub><sub>SMACK</sub>:
</p>
<p>
This selects the Simplified Mandatory Access Control Kernel.
Smack is useful for sensitivity, integrity, and a variety
of other mandatory security schemes.
If you are unsure how to answer this question, answer N.
</p>

<p>
Symbol: SECURITY<sub>SMACK</sub> [=y]
Type : boolean
Prompt: Simplified Mandatory Access Control Kernel Support
Location:
-&gt; Security options
Defined at security/smack/Kconfig:1
Depends on: NET [=y] &amp;&amp; INET [=y] &amp;&amp; SECURITY [=y]
Selects: NETLABEL [=y] &amp;&amp; SECURITY<sub>NETWORK</sub> [=y]
</p>
</div>

</div>

<div id="outline-container-13-8" class="outline-3">
<h3 id="sec-13-8"><span class="section-number-3">13.8</span> TOMOYO Linux Support (SECURITY<sub>TOMOYO</sub>)</h3>
<div class="outline-text-3" id="text-13-8">


<p>
CONFIG<sub>SECURITY</sub><sub>TOMOYO</sub>:
</p>
<p>
This selects TOMOYO Linux, pathname-based access control.
Required userspace tools and further information may be
found at <a href="http://tomoyo.sourceforge.jp/">http://tomoyo.sourceforge.jp/</a>.
If you are unsure how to answer this question, answer N.
</p>
<p>
Symbol: SECURITY<sub>TOMOYO</sub> [=y]
Type : boolean
Prompt: TOMOYO Linux Support
Location:
-&gt; Security options
Defined at security/tomoyo/Kconfig:1
Depends on: SECURITY [=y] &amp;&amp; NET [=y]
Selects: SECURITYFS [=y] &amp;&amp; SECURITY<sub>PATH</sub> [=y] &amp;&amp; SECURITY<sub>NETWORK</sub> [=y]
</p>

</div>

</div>

<div id="outline-container-13-9" class="outline-3">
<h3 id="sec-13-9"><span class="section-number-3">13.9</span> AppArmor support (SECURITY<sub>APPARMOR</sub>)</h3>
<div class="outline-text-3" id="text-13-9">


<p>
CONFIG<sub>SECURITY</sub><sub>APPARMOR</sub>:
</p>
<p>
This enables the AppArmor security module.
Required userspace tools (if they are not included in your
distribution) and further information may be found at
<a href="http://apparmor.wiki.kernel.org">http://apparmor.wiki.kernel.org</a>
</p>
<p>
If you are unsure how to answer this question, answer N.
</p>
<p>
Symbol: SECURITY<sub>APPARMOR</sub> [=y]
Type : boolean
Prompt: AppArmor support
Location:
-&gt; Security options
Defined at security/apparmor/Kconfig:1
Depends on: SECURITY [=y] &amp;&amp; NET [=y]
Selects: AUDIT [=y] &amp;&amp; SECURITY<sub>PATH</sub> [=y] &amp;&amp; SECURITYFS [=y] &amp;&amp; SECURITY<sub>NETWORK</sub> [=y]
</p>
</div>

</div>

<div id="outline-container-13-10" class="outline-3">
<h3 id="sec-13-10"><span class="section-number-3">13.10</span> Yama support (SECURITY<sub>YAMA</sub>)</h3>
<div class="outline-text-3" id="text-13-10">


<p>
CONFIG<sub>SECURITY</sub><sub>YAMA</sub>:
</p>
<p>
This selects Yama, which extends DAC support with additional
system-wide security settings beyond regular Linux discretionary
access controls. Currently available is ptrace scope restriction.
Further information can be found in Documentation/security/Yama.txt.
</p>
<p>
If you are unsure how to answer this question, answer N.
</p>
<p>
Symbol: SECURITY<sub>YAMA</sub> [=y]
Type : boolean
Prompt: Yama support
Location:
-&gt; Security options
Defined at security/yama/Kconfig:1
Depends on: SECURITY [=y]
Selects: SECURITYFS [=y] &amp;&amp; SECURITY<sub>PATH</sub> [=y]
</p>
</div>

</div>

<div id="outline-container-13-11" class="outline-3">
<h3 id="sec-13-11"><span class="section-number-3">13.11</span> Digital signature verification using multiple keyrings (INTEGRITY<sub>SIGNATURE</sub>)</h3>
<div class="outline-text-3" id="text-13-11">


<p>
CONFIG<sub>INTEGRITY</sub><sub>SIGNATURE</sub>:
</p>
<p>
This option enables digital signature verification support
using multiple keyrings. It defines separate keyrings for each
of the different use cases - evm, ima, and modules.
Different keyrings improves search performance, but also allow
to "lock" certain keyring to prevent adding new keys.
This is useful for evm and module keyrings, when keys are
usually only added from initramfs.
</p>
<p>
Symbol: INTEGRITY<sub>SIGNATURE</sub> [=y]
Type : boolean
Prompt: Digital signature verification using multiple keyrings
Location:
-&gt; Security options
Defined at security/integrity/Kconfig:6
Depends on: INTEGRITY [=y] &amp;&amp; KEYS [=y]
Selects: SIGNATURE [=y]
</p>
</div>

</div>
