Courses/4420/Lectures/Fortification/fortify.org
** Enables integrity auditing support (INTEGRITY_AUDIT)

CONFIG_INTEGRITY_AUDIT:

In addition to enabling integrity auditing support, this
option adds a kernel parameter 'integrity_audit', which
controls the level of integrity auditing messages.
0 - basic integrity auditing messages (default)
1 - additional integrity auditing messages

Additional informational integrity auditing messages would
be enabled by specifying 'integrity_audit=1' on the kernel
command line.

Symbol: INTEGRITY_AUDIT [=y]
Type : boolean
Prompt: Enables integrity auditing support 
Location:
-> Security options
Defined at security/integrity/Kconfig:20
Depends on: INTEGRITY [=y] && AUDIT [=y]


** Enable asymmetric keys support (INTEGRITY_ASYMMETRIC_KEYS)

CONFIG_INTEGRITY_ASYMMETRIC_KEYS:

This option enables digital signature verification using
asymmetric keys.

Symbol: INTEGRITY_ASYMMETRIC_KEYS [=y]
Type : boolean
Prompt: Enable asymmetric keys support
Location:
-> Security options
Defined at security/integrity/Kconfig:35
Depends on: INTEGRITY_SIGNATURE [=y]
Selects: ASYMMETRIC_KEY_TYPE [=y] && ASYMMETRIC_PUBLIC_KEY_SUBTYPE [=y] && PUBLIC_KEY_ALGO_RSA [=y] && X509_CERTIFICATE_PARSER [=y]

** Integrity Measurement Architecture(IMA) (IMA)

CONFIG_IMA:

The Trusted Computing Group(TCG) runtime Integrity
Measurement Architecture(IMA) maintains a list of hash
values of executables and other sensitive system files,
as they are read or executed. If an attacker manages
to change the contents of an important system file
being measured, we can tell.

If your system has a TPM chip, then IMA also maintains
an aggregate integrity value over this list inside the
TPM hardware, so that the TPM can prove to a third party
whether or not critical system files have been modified.
Read <http://www.usenix.org/events/sec04/tech/sailer.html>
to learn more about IMA.
If unsure, say N.

Symbol: IMA [=n]
Type : boolean
Prompt: Integrity Measurement Architecture(IMA)
Location:
-> Security options
Defined at security/integrity/ima/Kconfig:3
Depends on: SECURITY [=y]
Selects: INTEGRITY [=y] && SECURITYFS [=y] && CRYPTO [=y] && CRYPTO_HMAC [=y] && CRYPTO_MD5 [=y] && CRYPTO_SHA1 [=y] && TCG_TPM [=y] && TCG_TIS [=m] && TCG_IBMVTPM [=n]


** EVM support (EVM)

CONFIG_EVM:

EVM protects a file's security extended attributes against
integrity attacks.

If you are unsure how to answer this question, answer N.

Symbol: EVM [=y]
Type : boolean
Prompt: EVM support
Location:
-> Security options
Defined at security/integrity/evm/Kconfig:1
Depends on: SECURITY [=y] && KEYS [=y] && TRUSTED_KEYS [=y]!=m
Selects: CRYPTO_HMAC [=y] && CRYPTO_MD5 [=y] && CRYPTO_SHA1 [=y] && ENCRYPTED_KEYS [=y]

** Default security module

Select the security module that will be used by default if the
kernel parameter security= is not specified.


Prompt: Default security module
Location:
-> Security options
Defined at security/Kconfig:128
Selected by: m
SELinux (DEFAULT_SECURITY_SELINUX)

There is no help available for this option.
Symbol: DEFAULT_SECURITY_SELINUX [=n]
Type : boolean
Prompt: SELinux
Location:
-> Security options
-> Default security module (<choice> [=y])
Defined at security/Kconfig:141
Depends on: <choice>


** Simplified Mandatory Access Control (DEFAULT_SECURITY_SMACK)

There is no help available for this option.
Symbol: DEFAULT_SECURITY_SMACK [=n]
Type : boolean
Prompt: Simplified Mandatory Access Control
Location:
-> Security options
-> Default security module (<choice> [=y])
Defined at security/Kconfig:144
Depends on: <choice>


** TOMOYO (DEFAULT_SECURITY_TOMOYO)

There is no help available for this option.
Symbol: DEFAULT_SECURITY_TOMOYO [=n]
Type : boolean
Prompt: TOMOYO
Location:
-> Security options
-> Default security module (<choice> [=y])
Defined at security/Kconfig:147
Depends on: <choice>
AppArmor (DEFAULT_SECURITY_APPARMOR)

There is no help available for this option.
Symbol: DEFAULT_SECURITY_APPARMOR [=y]
Type : boolean
Prompt: AppArmor
Location:
-> Security options
-> Default security module (<choice> [=y])
Defined at security/Kconfig:150
Depends on: <choice>



** Yama (DEFAULT_SECURITY_YAMA)

There is no help available for this option.
Symbol: DEFAULT_SECURITY_YAMA [=n]
Type : boolean
Prompt: Yama
Location:
-> Security options
-> Default security module (<choice> [=y])
Defined at security/Kconfig:153
Depends on: <choice>


** Unix Discretionary Access Controls (DEFAULT_SECURITY_DAC)

There is no help available for this option.
Symbol: DEFAULT_SECURITY_DAC [=n]
Type : boolean
Prompt: Unix Discretionary Access Controls
Location:
-> Security options
-> Default security module (<choice> [=y])
Defined at security/Kconfig:156
Depends on: <choice>

** Asymmetric public-key crypto algorithm subtype (ASYMMETRIC_PUBLIC_KEY_SUBTYPE)

CONFIG_ASYMMETRIC_PUBLIC_KEY_SUBTYPE:

This option provides support for asymmetric public key type handling.
If signature generation and/or verification are to be used,
appropriate hash algorithms (such as SHA-1) must be available.
ENOPKG will be reported if the requisite algorithm is unavailable.

Symbol: ASYMMETRIC_PUBLIC_KEY_SUBTYPE [=y]
Type : tristate
Prompt: Asymmetric public-key crypto algorithm subtype
Location:
-> Cryptographic API (CRYPTO [=y])
-> Asymmetric (public-key cryptographic) key type (ASYMMETRIC_KEY_TYPE [=y])
Defined at crypto/asymmetric_keys/Kconfig:12
Depends on: CRYPTO [=y] && ASYMMETRIC_KEY_TYPE [=y]
Selects: MPILIB [=y]
Selected by: MODULE_SIG [=y] && MODULES [=y] || INTEGRITY_ASYMMETRIC_KEYS [=y] && INTEGRITY_SIGNATURE [=y]


