Courses/4420/Lectures/Hardening/Fortification/fortify.html

<div id="outline-container-13-12" class="outline-3">
<h3 id="sec-13-12"><span class="section-number-3">13.12</span> Enables integrity auditing support (INTEGRITY<sub>AUDIT</sub>)</h3>
<div class="outline-text-3" id="text-13-12">


<p>
CONFIG<sub>INTEGRITY</sub><sub>AUDIT</sub>:
</p>
<p>
In addition to enabling integrity auditing support, this
option adds a kernel parameter 'integrity<sub>audit'</sub>, which
controls the level of integrity auditing messages.
0 - basic integrity auditing messages (default)
1 - additional integrity auditing messages
</p>
<p>
Additional informational integrity auditing messages would
be enabled by specifying 'integrity<sub>audit</sub>=1' on the kernel
command line.
</p>
<p>
Symbol: INTEGRITY<sub>AUDIT</sub> [=y]
Type : boolean
Prompt: Enables integrity auditing support 
Location:
-&gt; Security options
Defined at security/integrity/Kconfig:20
Depends on: INTEGRITY [=y] &amp;&amp; AUDIT [=y]
</p>

</div>

</div>

<div id="outline-container-13-13" class="outline-3">
<h3 id="sec-13-13"><span class="section-number-3">13.13</span> Enable asymmetric keys support (INTEGRITY<sub>ASYMMETRIC</sub><sub>KEYS</sub>)</h3>
<div class="outline-text-3" id="text-13-13">


<p>
CONFIG<sub>INTEGRITY</sub><sub>ASYMMETRIC</sub><sub>KEYS</sub>:
</p>
<p>
This option enables digital signature verification using
asymmetric keys.
</p>
<p>
Symbol: INTEGRITY<sub>ASYMMETRIC</sub><sub>KEYS</sub> [=y]
Type : boolean
Prompt: Enable asymmetric keys support
Location:
-&gt; Security options
Defined at security/integrity/Kconfig:35
Depends on: INTEGRITY<sub>SIGNATURE</sub> [=y]
Selects: ASYMMETRIC<sub>KEY</sub><sub>TYPE</sub> [=y] &amp;&amp; ASYMMETRIC<sub>PUBLIC</sub><sub>KEY</sub><sub>SUBTYPE</sub> [=y] &amp;&amp; PUBLIC<sub>KEY</sub><sub>ALGO</sub><sub>RSA</sub> [=y] &amp;&amp; X509<sub>CERTIFICATE</sub><sub>PARSER</sub> [=y]
</p>
</div>

</div>

<div id="outline-container-13-14" class="outline-3">
<h3 id="sec-13-14"><span class="section-number-3">13.14</span> Integrity Measurement Architecture(IMA) (IMA)</h3>
<div class="outline-text-3" id="text-13-14">


<p>
CONFIG<sub>IMA</sub>:
</p>
<p>
The Trusted Computing Group(TCG) runtime Integrity
Measurement Architecture(IMA) maintains a list of hash
values of executables and other sensitive system files,
as they are read or executed. If an attacker manages
to change the contents of an important system file
being measured, we can tell.
</p>
<p>
If your system has a TPM chip, then IMA also maintains
an aggregate integrity value over this list inside the
TPM hardware, so that the TPM can prove to a third party
whether or not critical system files have been modified.
Read <a href="http://www.usenix.org/events/sec04/tech/sailer.html">http://www.usenix.org/events/sec04/tech/sailer.html</a>
to learn more about IMA.
If unsure, say N.
</p>
<p>
Symbol: IMA [=n]
Type : boolean
Prompt: Integrity Measurement Architecture(IMA)
Location:
-&gt; Security options
Defined at security/integrity/ima/Kconfig:3
Depends on: SECURITY [=y]
Selects: INTEGRITY [=y] &amp;&amp; SECURITYFS [=y] &amp;&amp; CRYPTO [=y] &amp;&amp; CRYPTO<sub>HMAC</sub> [=y] &amp;&amp; CRYPTO<sub>MD5</sub> [=y] &amp;&amp; CRYPTO<sub>SHA1</sub> [=y] &amp;&amp; TCG<sub>TPM</sub> [=y] &amp;&amp; TCG<sub>TIS</sub> [=m] &amp;&amp; TCG<sub>IBMVTPM</sub> [=n]
</p>

</div>

</div>

<div id="outline-container-13-15" class="outline-3">
<h3 id="sec-13-15"><span class="section-number-3">13.15</span> EVM support (EVM)</h3>
<div class="outline-text-3" id="text-13-15">


<p>
CONFIG<sub>EVM</sub>:
</p>
<p>
EVM protects a file's security extended attributes against
integrity attacks.
</p>
<p>
If you are unsure how to answer this question, answer N.
</p>
<p>
Symbol: EVM [=y]
Type : boolean
Prompt: EVM support
Location:
-&gt; Security options
Defined at security/integrity/evm/Kconfig:1
Depends on: SECURITY [=y] &amp;&amp; KEYS [=y] &amp;&amp; TRUSTED<sub>KEYS</sub> [=y]!=m
Selects: CRYPTO<sub>HMAC</sub> [=y] &amp;&amp; CRYPTO<sub>MD5</sub> [=y] &amp;&amp; CRYPTO<sub>SHA1</sub> [=y] &amp;&amp; ENCRYPTED<sub>KEYS</sub> [=y]
</p>
</div>

</div>

<div id="outline-container-13-16" class="outline-3">
<h3 id="sec-13-16"><span class="section-number-3">13.16</span> Default security module</h3>
<div class="outline-text-3" id="text-13-16">


<p>
Select the security module that will be used by default if the
kernel parameter security= is not specified.
</p>

<p>
Prompt: Default security module
Location:
-&gt; Security options
Defined at security/Kconfig:128
Selected by: m
SELinux (DEFAULT<sub>SECURITY</sub><sub>SELINUX</sub>)
</p>
<p>
There is no help available for this option.
Symbol: DEFAULT<sub>SECURITY</sub><sub>SELINUX</sub> [=n]
Type : boolean
Prompt: SELinux
Location:
-&gt; Security options
-&gt; Default security module (&lt;choice&gt; [=y])
Defined at security/Kconfig:141
Depends on: &lt;choice&gt;
</p>

</div>

</div>

<div id="outline-container-13-17" class="outline-3">
<h3 id="sec-13-17"><span class="section-number-3">13.17</span> Simplified Mandatory Access Control (DEFAULT<sub>SECURITY</sub><sub>SMACK</sub>)</h3>
<div class="outline-text-3" id="text-13-17">


<p>
There is no help available for this option.
Symbol: DEFAULT<sub>SECURITY</sub><sub>SMACK</sub> [=n]
Type : boolean
Prompt: Simplified Mandatory Access Control
Location:
-&gt; Security options
-&gt; Default security module (&lt;choice&gt; [=y])
Defined at security/Kconfig:144
Depends on: &lt;choice&gt;
</p>

</div>

</div>

<div id="outline-container-13-18" class="outline-3">
<h3 id="sec-13-18"><span class="section-number-3">13.18</span> TOMOYO (DEFAULT<sub>SECURITY</sub><sub>TOMOYO</sub>)</h3>
<div class="outline-text-3" id="text-13-18">


<p>
There is no help available for this option.
Symbol: DEFAULT<sub>SECURITY</sub><sub>TOMOYO</sub> [=n]
Type : boolean
Prompt: TOMOYO
Location:
-&gt; Security options
-&gt; Default security module (&lt;choice&gt; [=y])
Defined at security/Kconfig:147
Depends on: &lt;choice&gt;
AppArmor (DEFAULT<sub>SECURITY</sub><sub>APPARMOR</sub>)
</p>
<p>
There is no help available for this option.
Symbol: DEFAULT<sub>SECURITY</sub><sub>APPARMOR</sub> [=y]
Type : boolean
Prompt: AppArmor
Location:
-&gt; Security options
-&gt; Default security module (&lt;choice&gt; [=y])
Defined at security/Kconfig:150
Depends on: &lt;choice&gt;
</p>


</div>

</div>

<div id="outline-container-13-19" class="outline-3">
<h3 id="sec-13-19"><span class="section-number-3">13.19</span> Yama (DEFAULT<sub>SECURITY</sub><sub>YAMA</sub>)</h3>
<div class="outline-text-3" id="text-13-19">


<p>
There is no help available for this option.
Symbol: DEFAULT<sub>SECURITY</sub><sub>YAMA</sub> [=n]
Type : boolean
Prompt: Yama
Location:
-&gt; Security options
-&gt; Default security module (&lt;choice&gt; [=y])
Defined at security/Kconfig:153
Depends on: &lt;choice&gt;
</p>

</div>

</div>

<div id="outline-container-13-20" class="outline-3">
<h3 id="sec-13-20"><span class="section-number-3">13.20</span> Unix Discretionary Access Controls (DEFAULT<sub>SECURITY</sub><sub>DAC</sub>)</h3>
<div class="outline-text-3" id="text-13-20">


<p>
There is no help available for this option.
Symbol: DEFAULT<sub>SECURITY</sub><sub>DAC</sub> [=n]
Type : boolean
Prompt: Unix Discretionary Access Controls
Location:
-&gt; Security options
-&gt; Default security module (&lt;choice&gt; [=y])
Defined at security/Kconfig:156
Depends on: &lt;choice&gt;
</p>
</div>

</div>

<div id="outline-container-13-21" class="outline-3">
<h3 id="sec-13-21"><span class="section-number-3">13.21</span> Asymmetric public-key crypto algorithm subtype (ASYMMETRIC<sub>PUBLIC</sub><sub>KEY</sub><sub>SUBTYPE</sub>)</h3>
<div class="outline-text-3" id="text-13-21">


<p>
CONFIG<sub>ASYMMETRIC</sub><sub>PUBLIC</sub><sub>KEY</sub><sub>SUBTYPE</sub>:
</p>
<p>
This option provides support for asymmetric public key type handling.
If signature generation and/or verification are to be used,
appropriate hash algorithms (such as SHA-1) must be available.
ENOPKG will be reported if the requisite algorithm is unavailable.
</p>
<p>
Symbol: ASYMMETRIC<sub>PUBLIC</sub><sub>KEY</sub><sub>SUBTYPE</sub> [=y]
Type : tristate
Prompt: Asymmetric public-key crypto algorithm subtype
Location:
-&gt; Cryptographic API (CRYPTO [=y])
-&gt; Asymmetric (public-key cryptographic) key type (ASYMMETRIC<sub>KEY</sub><sub>TYPE</sub> [=y])
Defined at crypto/asymmetric<sub>keys</sub>/Kconfig:12
Depends on: CRYPTO [=y] &amp;&amp; ASYMMETRIC<sub>KEY</sub><sub>TYPE</sub> [=y]
Selects: MPILIB [=y]
Selected by: MODULE<sub>SIG</sub> [=y] &amp;&amp; MODULES [=y] || INTEGRITY<sub>ASYMMETRIC</sub><sub>KEYS</sub> [=y] &amp;&amp; INTEGRITY<sub>SIGNATURE</sub> [=y]
</p>

</div>

</div>
