Courses/4420/Lectures/Fortification/fortify.org
** RSA public-key algorithm (PUBLIC_KEY_ALGO_RSA)

CONFIG_PUBLIC_KEY_ALGO_RSA:

This option enables support for the RSA algorithm (PKCS#1, RFC3447).

Symbol: PUBLIC_KEY_ALGO_RSA [=y]
Type : tristate
Prompt: RSA public-key algorithm
Location:
-> Cryptographic API (CRYPTO [=y])
-> Asymmetric (public-key cryptographic) key type (ASYMMETRIC_KEY_TYPE [=y])
-> Asymmetric public-key crypto algorithm subtype (ASYMMETRIC_PUBLIC_KEY_SUBTYPE [=y])
Defined at crypto/asymmetric_keys/Kconfig:21
Depends on: CRYPTO [=y] && ASYMMETRIC_KEY_TYPE [=y] && ASYMMETRIC_PUBLIC_KEY_SUBTYPE [=y]
Selects: MPILIB_EXTRA
Selected by: MODULE_SIG [=y] && MODULES [=y] || INTEGRITY_ASYMMETRIC_KEYS [=y] && INTEGRITY_SIGNATURE [=y]

** X.509 certificate parser (X509_CERTIFICATE_PARSER)

CONFIG_X509_CERTIFICATE_PARSER:

This option procides support for parsing X.509 format blobs for key
data and provides the ability to instantiate a crypto key from a
public key packet found inside the certificate.

Symbol: X509_CERTIFICATE_PARSER [=y]
Type : tristate
Prompt: X.509 certificate parser
Location:
-> Cryptographic API (CRYPTO [=y])
-> Asymmetric (public-key cryptographic) key type (ASYMMETRIC_KEY_TYPE [=y])
-> Asymmetric public-key crypto algorithm subtype (ASYMMETRIC_PUBLIC_KEY_SUBTYPE [=y])
Defined at crypto/asymmetric_keys/Kconfig:28
Depends on: CRYPTO [=y] && ASYMMETRIC_KEY_TYPE [=y] && ASYMMETRIC_PUBLIC_KEY_SUBTYPE [=y]
Selects: ASN1 [=y] && OID_REGISTRY [=y]
Selected by: MODULE_SIG [=y] && MODULES [=y] || INTEGRITY_ASYMMETRIC_KEYS [=y] && INTEGRITY_SIGNATURE [=y]



* References

