Courses/4420/Lectures/Hardening/Fortification/fortify.html

<div id="outline-container-13-22" class="outline-3">
<h3 id="sec-13-22"><span class="section-number-3">13.22</span> RSA public-key algorithm (PUBLIC<sub>KEY</sub><sub>ALGO</sub><sub>RSA</sub>)</h3>
<div class="outline-text-3" id="text-13-22">


<p>
CONFIG<sub>PUBLIC</sub><sub>KEY</sub><sub>ALGO</sub><sub>RSA</sub>:
</p>
<p>
This option enables support for the RSA algorithm (PKCS#1, RFC3447).
</p>
<p>
Symbol: PUBLIC<sub>KEY</sub><sub>ALGO</sub><sub>RSA</sub> [=y]
Type : tristate
Prompt: RSA public-key algorithm
Location:
-&gt; Cryptographic API (CRYPTO [=y])
-&gt; Asymmetric (public-key cryptographic) key type (ASYMMETRIC<sub>KEY</sub><sub>TYPE</sub> [=y])
-&gt; Asymmetric public-key crypto algorithm subtype (ASYMMETRIC<sub>PUBLIC</sub><sub>KEY</sub><sub>SUBTYPE</sub> [=y])
Defined at crypto/asymmetric<sub>keys</sub>/Kconfig:21
Depends on: CRYPTO [=y] &amp;&amp; ASYMMETRIC<sub>KEY</sub><sub>TYPE</sub> [=y] &amp;&amp; ASYMMETRIC<sub>PUBLIC</sub><sub>KEY</sub><sub>SUBTYPE</sub> [=y]
Selects: MPILIB<sub>EXTRA</sub>
Selected by: MODULE<sub>SIG</sub> [=y] &amp;&amp; MODULES [=y] || INTEGRITY<sub>ASYMMETRIC</sub><sub>KEYS</sub> [=y] &amp;&amp; INTEGRITY<sub>SIGNATURE</sub> [=y]
</p>
</div>

</div>

<div id="outline-container-13-23" class="outline-3">
<h3 id="sec-13-23"><span class="section-number-3">13.23</span> X.509 certificate parser (X509<sub>CERTIFICATE</sub><sub>PARSER</sub>)</h3>
<div class="outline-text-3" id="text-13-23">


<p>
CONFIG<sub>X509</sub><sub>CERTIFICATE</sub><sub>PARSER</sub>:
</p>
<p>
This option procides support for parsing X.509 format blobs for key
data and provides the ability to instantiate a crypto key from a
public key packet found inside the certificate.
</p>
<p>
Symbol: X509<sub>CERTIFICATE</sub><sub>PARSER</sub> [=y]
Type : tristate
Prompt: X.509 certificate parser
Location:
-&gt; Cryptographic API (CRYPTO [=y])
-&gt; Asymmetric (public-key cryptographic) key type (ASYMMETRIC<sub>KEY</sub><sub>TYPE</sub> [=y])
-&gt; Asymmetric public-key crypto algorithm subtype (ASYMMETRIC<sub>PUBLIC</sub><sub>KEY</sub><sub>SUBTYPE</sub> [=y])
Defined at crypto/asymmetric<sub>keys</sub>/Kconfig:28
Depends on: CRYPTO [=y] &amp;&amp; ASYMMETRIC<sub>KEY</sub><sub>TYPE</sub> [=y] &amp;&amp; ASYMMETRIC<sub>PUBLIC</sub><sub>KEY</sub><sub>SUBTYPE</sub> [=y]
Selects: ASN1 [=y] &amp;&amp; OID<sub>REGISTRY</sub> [=y]
Selected by: MODULE<sub>SIG</sub> [=y] &amp;&amp; MODULES [=y] || INTEGRITY<sub>ASYMMETRIC</sub><sub>KEYS</sub> [=y] &amp;&amp; INTEGRITY<sub>SIGNATURE</sub> [=y]
</p>


</div>
</div>

</div>

<div id="outline-container-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> References</h2>
<div class="outline-text-2" id="text-14">


</div>
</div>
</div>

<div id="postamble">
<hr size=1>Copyright &copy; 2013 &bull; <a href="http://www.wright.edu/~pmateti"> www.wright.edu/~pmateti</a> &bull; 2013-11-07T15:21-0500
</div>
</body>
</html>
